resources/hasob-foundation-core-bs-5/src/Managers/OrganizationManager.php

select * from `fc_organizations` where `is_local_default_organization` = 1 and `fc_organizations`.`deleted_at` is null limit 1
---
    public function loadTenant($identifier) {

        if (Schema::hasTable('fc_organizations') == false){
            Log::error("Unable to set Organization ID as organizations table doesn't exist on DB");
            return null;
        }

        if ($identifier == "127.0.0.1" || $identifier == "localhost"){

            //this is local development
            Log::info("Local development environment detected.");
            $default_org_id = env('DEFAULT_ORGANIZATION', null);

            if ($default_org_id != null){

                Log::info("Identified Organization from env settings => {$default_org_id}");
                $tenant = Organization::find($default_org_id);

            }else{

                $tenant = Organization::where('is_local_default_organization', true)->first();