resources/hasob-foundation-core-bs-5/src/Traits/Artifactable.php

    public function artifact($key){
        return ModelArtifact::where('model_primary_id',$this->id)
                        ->where('key', $key)
                        ->where('model_name', self::class)
                        ->orderBy('created_at')
                        ->first();
---
select * from `fc_model_artifacts` where `model_primary_id` = 'c838a375-edf5-41be-905d-6bb0c732cd03' and `key` = 'features' and `model_name` = 'Hasob\FoundationCore\Models\Organization' order by `created_at` asc limit 1