resources/hasob-foundation-core-bs-5/src/Traits/Attachable.php

    public function get_attachments($file_types = null){
        $attachables_query = EloquentAttachable::where('attachable_id', $this->id)
                                            ->where('attachable_type', self::class)
                                            ->orderBy('created_at','desc');

        $attachables = $attachables_query->get();
---
select * from `fc_attachables` where `attachable_id` = '58d2bb07-09e0-4bb3-91d0-f1bc98a08b3d' and `attachable_type` = 'Hasob\Workflow\Models\WorkItem' and `fc_attachables`.`deleted_at` is null order by `created_at` desc