resources/hasob-foundation-core-bs-5/src/Traits/Commentable.php

    public function get_comments(){
        return Comment::where('commentable_id',$this->id)
                        ->where('commentable_type',self::class)
                        ->orderBy('created_at', 'desc')
                        ->get();
---
select * from `fc_comments` where `commentable_id` = '58d2bb07-09e0-4bb3-91d0-f1bc98a08b3d' and `commentable_type` = 'Hasob\Workflow\Models\WorkItem' and `fc_comments`.`deleted_at` is null order by `created_at` desc