resources/hasob-foundation-core-bs-5/src/Models/Department.php

select * from `fc_departments` where `organization_id` = 'c838a375-edf5-41be-905d-6bb0c732cd03' and `fc_departments`.`deleted_at` is null
---
    public static function all_departments(Organization $org = null){

        $model = new Department();
        $query = $model->newQuery();

        if ($org!=null){
            $query->where('organization_id', $org->id);
        }

        return $query->get();