resources/hasob-foundation-core-bs-5/src/Models/User.php

select * from `fc_users` where `organization_id` = 'c838a375-edf5-41be-905d-6bb0c732cd03' and `fc_users`.`deleted_at` is null
---
    public static function all_users(Organization $org = null){

        $model = new User();
        $query = $model->newQuery();

        if ($org!=null){
            $query->where('organization_id', $org->id);
        }

        return $query->get();